package org.example.less_5.hw;

public class Homework {

  /**
   * 0. Осознать код, который мы написали на уроке.
   * При появлении вопросов, пишем в общий чат в телеграме.
   * 1. По аналогии с командой отправки сообщений, реализовать следующие команды:
   * 1.1 BroadcastMessageRequest - послать сообщение ВСЕМ пользователям (кроме себя)
   * 1.2 UsersRequest - получить список всех логинов, которые в данный момент есть в чате (в любом формате)
   * 1.3 DisconnectRequest - клиент оповещает сервер о том, что он отключился
   * 1.3.1 * Доп. задание: при отключении юзера, делать рассылку на остальных
   *
   * Можно сделать только один пункт из 1.1-1.3.
   */

}
